# Типы данных в питоне



# 1. NoneType - Ничего, пустота --> None
# 2. Boolean - Истина или ложь --> True/False 
# 3. str() - Строки (текстовое инфо) --> "Hello world", 'My name is Edi'
# 4. Числовые типы данных:
    # a. integer - int() - Целое число (-1, -2, 0, 1, 2)
    # b. flout() - Число в плаввющей точкой (-1.2, 10.15, 2.7)
    # c. complex() - коплексные числы (5+6i10)
# 5. Списковые данные
    # a. List(список/массив) --> [1, 2, 3 None, 'Hello', True, False, [1, 2, 3]]
    # b. tuple (кортеж) --> (1, 2, 3, 4, None)
    # c. rang(последовательность) --> rang (1, 1)
# 6. set() --> Множества
# 7. dict(словари) --> содержит данные в виде ключа и значения --> {1: 'One', 2: 'Two'} 

# ******************************************************************************************

# Mutable(Изменяемые типы данных)
    # 1.list
    # 2. set
    # 3. dict 

# Immitable(неизменяемые типы данных)
    # 1. NoneType
    # 2. boolean
    # 3. int 
    # 4. float 
    # 5. complex
    # 6. tuple
    # 7. frozenset
# *********************************************************************************************

# '''Стандартный вывод данных'''
# """
# в пайтоне для вывода в терминал используются встроенная функция print()"""

# print ('Hello world')
# print(27+5)

# '''Стандартный вывод данных черезмтерминал используются imput()'''

# # a = input('Выведите число')
# # print('В а хранится:')

# # print(a)

# print(input('Ввыведите свое имя'))

